export const questions = [
  {
    number: '1/12',
    question: '"리액션 논쟁" 나, 연인, 친구 셋이서 술을 먹는데 더 짜증나는 상황은?',
    choices: [
      {text: '내 친구가 무슨 말 만 하면 내 연인이 지나치게 리액션을 한다.', value: '1'},
      {text: '내 연인이 무슨 말 만 하면 내 친구가 지나치게 리액션을 한다.', value: '0'}
    ]
  },
  {
    number: '2/12',
    question: '"깻잎 논쟁" 나, 연인, 친구 셋이 밥을 먹는데 내 친구가 깻잎을 못떼고 낑낑 거릴 때 내 연인이 내 친구의 깻잎을 떼어 준다면?',
    choices: [
      {text: '그럴수도 있지 괜찮다.', value: '0'},
      {text: '절대 안됨 손없음?', value: '1'}
    ]
  },
  {
    number: '3/12',
    question: '"롱패딩 논쟁" 나, 연인, 친구 셋이서 길을 가는데 연인이 내 친구의 패딩 지퍼를 대신 올려준다면?',
    choices: [
      {text: '된다.', value: '0'},
      {text: '안된다.', value: '1'}
    ]
  },
  {
    number: '4/12',
    question: '"결혼 논쟁" 나, 연인, 친구 셋이서 놀던 중 친구가 장난으로 "너네는 언제 결혼 할거냐?" 라고 물었더니 연인이 "나 비혼주의자야" 라고 대답했다. 나는?',
    choices: [
      {text: '장난 식으로 대답 했겠지 하고 그냥 넘어간다.', value: '0'},
      {text: '이건 장난이라고 해도 좀 기분이 상해서 "나도 결혼 할 생각 없다" 라고 말한다.', value: '1'}
    ]
  },
  {
    number: '5/12',
    question: '"쌈 논쟁" 나, 연인, 친구 셋이 고기를 먹으러 갔다. 친구가 고기를 굽고 있어서 연인이 쌈을 친구를 먹여줬다.',
    choices: [
      {text: '안 괜찮다.', value: '1'},
      {text: '괜찮다.', value: '0'}
    ]
  },
  {
    number: '6/12',
    question: '"호수 논쟁" 수영을 할 줄 모르는 절친과 연인이 호수에 빠졌다. 둘 중 누굴 구할 것인가?',
    choices: [
      {text: '연인', value: '1'},
      {text: '절친', value: '0'}
    ]
  },
  {
    number: '7/12',
    question: '"부축임 논쟁" 나, 연인, 친구 셋이 길을 가던 중 친구가 돌에 걸려 넘어졌다. 연인이 괜찮냐면서 친구의 팔을 붙잡으며 부축해 주었다.',
    choices: [
      {text: '알아서 일어날텐데 굳이 왜 잡아', value: '1'},
      {text: '도와주는거니까 상관없다.', value: '0'}
    ]
  },
  {
    number: '8/12',
    question: '"택시 논쟁" 나, 연인, 친구 셋이서 놀다가 각자 집으로 가야한다. 내 연인과 내 친구 둘 다 집이 같은 방향이라 둘이 같이 택시를 타고 가야한다.',
    choices: [
      {text: '절대 안됨', value: '1'},
      {text: '같은 방향이면 어쩔 수 없지', value: '0'}
    ]
  },
  {
    number: '9/12',
    question: '"후드집업 논쟁" 나, 연인, 친구가 함께 카페에 있는데 친구가 에어컨 때문에 너무 춥다고 연인한테 후드집업을 빌려을 빌려달라고 한다면?',
    choices: [
      {text: '빌려줘도 상관없음', value: '0'},
      {text: '절대 안됨', value: '1'}
    ]
  },
  {
    number: '10/12',
    question: '"이벤트 논쟁" 연인이 내 친구와 단 둘이, 나를 위한 깜짝 이벤트를 한 달간 몰래 만나며 준비했다.',
    choices: [
      {text: '괜찮다.', value: '0'},
      {text: '안 괜찮다.', value: '1'}
    ]
  },
  {
    number: '11/12',
    question: '"핫도그 논쟁" 친구네 커플과 여행을 갔다 오는 도중에 휴게소에 들려서 나는 통감자, 연인은 핫도그를 골랐는데 친구가 내 연인에게 핫도그 한 입만 달라고 한다면?',
    choices: [
      {text: '싫음, 니가 사먹어', value: '1'},
      {text: '먹고 싶을 수도 있지', value: '0'}
    ]
  },
  {
    number: '12/12',
    question: '"여행 논쟁" 연인이 어렸을 적 부터 친했던 동성 친구들 2명과 이성 친구들 3명이서 1박 2일로 여행을 간다고 말했다.',
    choices: [
      {text: '절대 안된다.', value: '1'},
      {text: '친구들이니까 된다.', value: '0'}
    ]
  }
]