export const questions = [
  {
    number: '1/12',
    question: '나는 먼저 약속을 잡는 편이다.',
    choices: [
      {text: '그렇다.', value: 'e'},
      {text: '그렇지 않다.', value: 'i'}
    ]
  },
  {
    number: '2/12',
    question: '주말에 약속이 없다. 나는?',
    choices: [
      {text: '그냥 침대에 누어서 폰을 하고 쉰다.', value: 'e'},
      {text: '집에 있는게 싫어서 친구들한테 연락을 돌린다.', value: 'i'}
    ]
  },
  {
    number: '3/12',
    question: '내 친구들의 mbti는 보통',
    choices: [
      {text: 'I보단 E가 많다.', value: 'e'},
      {text: 'E보단 I가 많다.', value: 'i'}
    ]
  },
  {
    number: '4/12',
    question: '얘기하다가 친구가 이런 질문을 했다. "어느날 갑자기 100억이 생기면 어떻게 할거야?" 나는?',
    choices: [
      {text: '적당한 건물 하나 사서 월세 받는 백수', value: 's'},
      {text: '실패를 무릅쓰고 사업이나 투자에 도전', value: 'n'}
    ]
  },
  {
    number: '5/12',
    question: '연인과 함께 제주도 계획을 짜고 있다. 데이트를 즐기고 맛집을 어디로 갈지 정할려고 한다. 나는?',
    choices: [
      {text: '데이트 장소 바로 옆 평범한 제주 흑돼지 맛집', value: 's'},
      {text: '데이트 장소와 거리는 멀지만 제주도에서 꼭 먹어봐야하는 제주 흑돼지 맛집', value: 'n'}
    ]
  },
  {
    number: '6/12',
    question: '주로 카페에서 음료를 시킬때, 나는?',
    choices: [
      {text: '항상 먹던 음료를 시킨다.', value: 's'},
      {text: '그날 먹고 싶은 음료가 있다.', value: 'n'}
    ]
  },
  {
    number: '7/12',
    question: '친구랑 동네 마실로 카페를 갈때 나의 패션은?',
    choices: [
      {text: '동네 마실을 가든 자기 만족이니까 나름 꾸며 입음', value: 'f'},
      {text: '동네 마실가는데 패션이 뭐가 중요해 그냥 대충 입음', value: 't'}
    ]
  },
  {
    number: '8/12',
    question: '사람이 많은 광장에서 걷다가 발을 헛디뎌서 넘어졌다.',
    choices: [
      {text: '아무 일도 없는 척 주변을 살핀다.', value: 'f'},
      {text: '재빨리 빠른 걸음으로 그 곳을 벗어난다.', value: 't'}
    ]
  },
  {
    number: '9/12',
    question: '연인과 데이트 도중 사소한 일로 다툼이 벌어졌다. 나는?',
    choices: [
      {text: '지금은 서로 열이 너무 올랐으니까 일단 사과하고 화가 가라앉힐때 다시 얘기한다.', value: 'f'},
      {text: '일이 크게 번지더라도 지금 잘못한건 지금 끝내야한다.', value: 't'}
    ]
  },
  {
    number: '10/12',
    question: '놀러갈때. 나의 일정표는?',
    choices: [
      {text: '(시분 단위로 완벽하게 짠 일정표)<br><br>9:00 출발<br>11:30 ㅁㅁ맛집<br>13:00 ㅁㅁ거리 구경하고 사진찍기<br>14:00 ㅁㅁ데이트<br>17:30 저녁으로 ㅁㅁ맛집', value: 'j'},
      {text: '(대략적인 코스만 적혀있는 일정표)<br><br>ㅁㅁ맛집<br>ㅁㅁ거리<br>ㅁㅁ데이트<br>ㅁㅁ맛집', value: 'p'}
    ]
  },
  {
    number: '11/12',
    question: '놀이동산에 놀러왔다. 나는?',
    choices: [
      {text: '그냥 걷다가 재밌어 보이는 놀이기구를 탄다.', value: 'p'},
      {text: '어떤 놀이기구를 탈지 미리 정해두고 탄다.', value: 'j'}
    ]
  },
  {
    number: '12/12',
    question: '내일 이른 아침부터 약속이 잡혀있다. 자기 전 나의 알람 수는?',
    choices: [
      {text: '1~2개', value: 'j'},
      {text: '5개 이상', value: 'p'}
    ]
  }
]

export const results = [
  {
    title: '캠핑 데이트',
    character: '../images/캠핑데이트.png',
    results: [
      '겉으로는 무뚝뚝해 보일 수 있지만 속은 진짜 따뜻하고 배려 넘치는 사람이에요.<br>평소에 책임감이 강하고 사소한 부분들까지 잘 챙겨주는 스타일이에요.<br>그래서 친구들끼리 여행을 갈때 혹은 계획을 해두고 어디를 놀러갈 때 주로 리더역할을 맡는 편이에요.<br>그리고 정해진 계획에 틀어지는 걸 싫어하고 은근 고집이 있는 편이에요.<br>그래서 약속 시간을 어기는 것을 진짜 싫어하고<br>누가 하는 걸 가만히 앉아서 지켜볼 수가 없어요.<br>그래서 고기를 굽는 것도 다 내가 하는게 편해요.<br>그리고 가만히 앉아서 시끄럽게 노는 것 보단 놀때도 무언가를 하면서 노는걸 좋아하기 때문에.<br>날을 잡고 친구들이나 혹은 연인이랑 캠핑이나 글램핑을 가는 것을 추천해요.<br>아니면 영상통화를 하면서 같이 여행계획을 세우거나 자기 할일 하면서 즐겁게 영상통화하는 것도 좋을 것 같아요.<br>캠핑은 당장 갈 수 없으니 백화점이나 아울렛 구경가는 건 어때요?<br>쇼핑도 하면서 즐겁게 놀다오기 딱 좋은 거 같아요.',
    ],
    compatibility: ['../images/영상통화.png', '../images/백화점아울렛.png'],
  },
  {
    title: '아이스 링크',
    character: '../images/아이스링크.png',
    results: [
      '워낙 핵인싸 성격이라 어디서든 적응을 잘 하고 관심 받는 것을 좋아해요.<br>그래서 주변사람들을 항상 웃게 만들고 싶고 주변이들의 이목을 끄는 것을 좋아해요.<br>그리고 놀때는 무언가를 보고 만지고 오감을 느끼면서 즐기는 것을 좋아해요.<br>그리고 지금 이 순간을 즐기자가 삶의 모토이고 계획이 정해져 있는것 보단 자유롭고 충동적으로 노는것을 좋아해요.<br>그리고 말보다는 직접 몸으로 부딪히는 것을 좋아하기 때문에<br>빙판 위를 달리면서 자유로운 기분을 느낄 수 있는 아이스링크를 추천드리고 싶어요.<br>아니면 소소하게 친구들 혹은 연인하고 요즘 대세인 sns영상을 찍는 것도 웃기고 재밌을거 같아요.<br>목표 달성을 위해서라면 어떤 노력이든 하는 편이고 은근 예술가적 기질이 있어 무언가를 만드는 데에도 소질이 있기 때문에<br>도자기 공방에서 멋진 도자기를 만들어보는 것도 추천드리고 싶어요.',
    ],
    compatibility: ['../images/커플sns영상찍기.png', '../images/도자기공방.png'],
  },
  {
    title: '아쿠아리움',
    character: '../images/아쿠아리움.png',
    results: [
      '동료애가 많고 주위 사람들에게 관심을 쏟으며 항상 행복하고 즐겁게 해주고자 노력해요.<br>참을성이 많고 책임감이 강하고 상대방에게 필요한 사람이 되기 위해서 노력을 많이 해요.<br>그리고 친구, 가족, 내 사람을 잘 챙기고 항상 다정하게 대합니다.<br>남 얘기에 리액션을 잘해주고 어색한 분위기를 참지 못해서 먼저 말을 걸면서 재밌는 분위기를 만들려고 노력해요.<br>친구들 고민 상담도 잘해주고 인간관계에서 본인은 상처를 받더라도 상대방의 기분을 생각하는 헌신적이고 배려가 넘치는 모습이 마치 넓은 바다와 같아요.<br>본인 모습과 닮은 아쿠아리움에 놀러가서 구경을 하면서 쌓였던 스트레스도 풀고 마음을 다시 한번 잡아봐요<br>친구들하고 신나는 노래를 부르면서 스트레스를 푸는 것도 좋을 것 같아요.<br>생각은 진짜 창의적인데 실행력이 부족한 나 VR체험을 하면서 스트레스도 풀고 다양한 경험들도 하면서 세상을 넓게 바라보고 자신감을 더 가져봐요',
    ],
    compatibility: ['../images/노래방.png', '../images/VR체험.png'],
  },
  {
    title: '이색 카페',
    character: '../images/카페탐방.png',
    results: [
      '사람들을 자주 만나는 것을 좋아하고 항상 에너지가 넘쳐요.<br>그리고 계획적인 성격보단 즉흥적이고 새로운 사람들을 만나는 걸 어려워하지 않아요.<br>순간 즐거움에 쉽게 빠져들어 재밌거나 신나면 나도 모르게 흥얼거리면서 리듬을 탈때가 많아요.<br>그리고 주위 사람들이나 일어나는 일에 관심이 많고 특히 주위 사람들에게 위로나 용기를 주는데 에너지를 많이 써요.<br>대화하다 침묵이 흐르는 것을 제일 싫어하고 놀때는 항상 재밌고 신나는 분위기를 선호하고 색다르게 할 수 있는 일들을 좋아하기 때문에<br>카페 탐방을 추천드리고 싶어요. 커피나 차마시는 카페가 아닌 낚시카페나 암흑카페, 애견카페 말고도 색다른 재미를 느낄 수 있는 카페들을 찾아서 가보시는 걸 추천드려요.<br>아니면 재밌는 포즈를 지으면서 친구들이나 연인하고 가볍게 인생네컷을 여러장을 찍어서 추억을 간직하는 것도 좋아요.<br>때로는 진지한 분위기에 익숙해질 필요가 있어서 진지한 분위기에 적응도 하고 색다른 재미도 느낄 수 있는 연극을 보러 가는 것도 추천드리고 싶어요.',
    ],
    compatibility: ['../images/가볍게인생네컷.png', '../images/연극보기.png'],
  },
  {
    title: '맛집 뿌시기',
    character: '../images/맛집뿌시기.png',
    results: [
      '첫인상은 딱딱하고 까칠한 사람처럼 보일 수 있지만 가까운 사람들에게는 부드럽고 칭찬도 많이 해주는 편이에요.<br>워낙 워커홀릭이라 놀고 쉬는 것에 있어 시간을 많이 투자하지 않아요.<br>노는 것 역시 간단히 대화 나누면서 밥먹거나 차 한잔 하는 정도에요.<br>그리고 상상을 자주하는 편이고 미래에 대한 바램이 크기 때문에 미래지향적인 대화 소재를 가지고 1시간 이상 대화를 나눌 수 있어요.<br>맛집 뿌시기를 추천드리고 싶어요 맛있는 것도 먹고 고민이나 수다도 나누고 일석이조!<br>너무 완벽주의를 추구하는 경향이 있어서 가끔씩은 깨야할 필요가 있어요. 마치 규칙대로 세워진 볼링핀을 볼링공으로 그 틀을 깨는 것 처럼 볼링장에 가서 신나게 놀아보는 것도 추천드려요.<br>그리고 은근히 자존심도 세고 도전적인 면이 있기 때문에 귀신의 집이 딱 어울릴 것 같아요.',
    ],
    compatibility: ['../images/술배틀.png', '../images/귀신의집.png'],
  },
  {
    title: '물놀이 데이트',
    character: '../images/물놀이데이트.png',
    results: [
      '자존감이 높고 일단 하고 보는 성격이기에 무슨 일을 하든 일단 저지르고 뒷 일 생각은 나중에 하는 경향이 있어요.<br>극한의 위기가 불어 닥쳐도 임기응변에 능하고 상황 판단을 단번에 하기 때문에 가장 먼저 벗어날 수 있어요.<br>첼린지나 유행 템 등 인싸들이 한다는 것들은 절대 안해요.<br>변화 없이 사는 인생을 진짜 싫어하고 놀때 역시 항상 똑같은 것을 하면서 노는걸 싫어해요.<br>그리고 놀때는 친구들한테 장난치고 괴롭히는 걸 좋아해요.<br>오래간만에 워터파크나 수상레저 등 물놀이를 즐기는 걸 추천드리고 싶어요.<br>물을 싫어하거나 소소하게 즐기고 싶다면 바다 구경을 가보는 것도 추천해요.<br>본인이 구상하는 바를 실현시키고 싶고 구체제를 뒤집어 버리고 새체제를 세우고 싶고 말 그대로 혁명가적 기질을 가지고 있기 때문에 서바이벌 게임장도 어울릴 것 같아요.',
    ],
    compatibility: ['../images/공원에서배드민턴.png', '../images/도자기공방.png'],
  },
  {
    title: '교복 데이트',
    character: '../images/교복데이트.png',
    results: [
      '꽤나 인간관계를 중요시하고 정이 많고 내 사람들을 잘 챙겨요.<br>그래서 주변사람들에게 돈에 휘둘리지 않고 퍼주는 걸 좋아해요.<br>무리에 속해서 노는 것도 좋아하지만 가끔씩은 여가시간을 혼자 보내는 것도 좋아해요.<br>그리고 호기심이 많은 편이여서 직접 먹어보고 다 해봐야 적성이 풀려요.<br>그리고 생각없이 신나게 노는 것도 좋지만 오래 담소를 나누는 걸 더 좋아해요.<br>그리고 어딜 가거나 무언가를 할때 사진으로 남기는 것을 좋아하기 때문에<br>친구들 혹은 연인하고 교복 데이트로 놀이동산이나 드라마 세트장을 가서 사진도 많이 찍고 즐기기에 좋을 것 같아요.<br>아니면 공원이나 한강에서 자전거 데이트를 해보는 것도 재밌을 것 같아요.<br>감성적인 분위기를 좋아하는 편이고 알코올이 들어가면 깊은 담소도 나눌 수 있으니 느낌있는 칵테일 바를 추천드리고 싶네요.',
    ],
    compatibility: ['../images/공원자전거데이트.png', '../images/칵테일바.png'],
  },
  {
    title: '스포츠 데이트',
    character: '../images/스포츠데이트.png',
    results: [
      '항상 열정이 넘치고 도전적이여서 예체능 쪽으로 재능이 있고 다양한 것을 시도하려고 해요.<br>주변사람들에게 관심이 많고 친구들 혹은 주변이들과 건강한 관계를 만들기 위해서 헌신하고 열정을 다하기 때문에<br>주변에 친구들이 많고 새로운 사람들을 만나는 것에 대해서 거리낌이 없어요.<br>활발하고 열정적인 성격이 볼링이나 농구 등 공으로 할 수 있는 스포츠와 잘 어울리고 재밌을거에요.<br>어떻게 보면 너무 열정적이여서 스스로에게 여유도 필요할 것 같아요. 가끔씩은 간단하게 공원 산책을 나가는 것도 좋을 것 같네요.<br>그리고 단순한 즐거움이나 그때 그때 상황에서 일시적인 만족이 아닌 깊은 유대 관계를 맺음으로써 행복을 느끼기 때문에 찜질방도 추천드리고 싶어요.<br>작은 공간 안에서 웃고 떠들고 하면서 깊은 유대감을 쌓을 수 있고 재미있는 추억으로 남을 것 같아요.',
    ],
    compatibility: ['../images/공원산책.png', '../images/찜질방데이트.png'],
  },
  {
    title: '피크닉 데이트',
    character: '../images/피크닉데이트.png',
    results: [
      '낯가림이 심한 편이고 굳이 목적없이 잘 모르는 사람들과 어울리는 것을 싫어해요.<br>겉보기에는 차갑고 딱딱해 보이지만 본인이 진정 믿고 사랑하는 상대를 만나게 되면 아낌없이 쏟아붇고 따뜻해요.<br>평소에 의젓한 성격이여서 장남, 장녀같다는 말을 많이 듣는편 이에요.<br>예고 없는 갑작스러운 변화를 매우 싫어하고 현실성, 대중성을 중시하므로 취미을 가져도 일반적이거나 전통적인 것을 선호해요.<br>가까운 사람들과 한강이나 공원에서 피크닉을 즐기면서 낭만적이고 좋은 추억을 보내는 걸 추천드리고 싶어요.<br>그리고 평소에 남들이 속을 모른다고 말하는 편이에요.<br>그래서 알 수 없는 미래를 예측하는 타로 카드와 잘 어울리네요. 소소하게 타로 카페를 가보는 것도 추천드려요.<br>그리고 스트레스나 고민이 있으면 속에 쌓아두고 참고 참았다가 나중에 터뜨리는 편이에요.<br>등산을 하면서 속에 쌓아두었던 것들을 잊어보는 시간을 가져봐요.',
    ],
    compatibility: ['../images/타로카페.png', '../images/등산.png'],
  },
  {
    title: '방탈출 카페',
    character: '../images/방탈출카페.png',
    results: [
      '',
    ],
    compatibility: ['../images/셀프사진관.png', '../images/만화방.png'],
  },
  {
    title: '야시장 데이트',
    character: '../images/야시장데이트.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/비행기모드.png', '../images/박물관미술관.png'],
  },
  {
    title: '커플 데이트',
    character: '../images/커플데이트.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/드라이브.png', '../images/커플앨범만들기.png'],
  },
  {
    title: '오락실 데이트',
    character: '../images/오락실데이트.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/영화.png', '../images/전망대.png'],
  },
  {
    title: '만원의 행복',
    character: '../images/만원의행복.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/헬스클럽.png', '../images/양궁장사격장.png'],
  },
  {
    title: '공방 데이트',
    character: '../images/공방데이트.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/요리해먹기.png', '../images/스키장.png'],
  },
  {
    title: '카메라 데이트',
    character: '../images/카메라데이트.png',
    results: [
      '결과 속성1',
    ],
    compatibility: ['../images/대학가구경.png', '../images/룸카페.png'],
  }
]

export const mbtis = {
  estj:0, // 
  estp:1, // 
  esfj:2, // 
  esfp:3, // 

  entj:4, // 
  entp:5, // 
  enfj:6, // 
  enfp:7, // 

  istj:8, // 
  istp:9, // 
  isfj:10, // 
  isfp:11, // 

  intj:12, // 
  intp:13, // 
  infj:14, // 
  infp:15, // 
}