export const questions = [
  {
    number: '1/12',
    question: '연인과 데이트를 하다가 연인의 동창과 만났다. 나는?',
    choices: [
      {text: '인사를 하며 같이 대화에 낀다.', value: 'e'},
      {text: '인사만 하고 대화가 끝날 때 까지 기다린다.', value: 'i'}
    ]
  },
  {
    number: '2/12',
    question: '주말에 약속이 없는 나는?',
    choices: [
      {text: '집돌이 집순이가 된다.', value: 'i'},
      {text: '어떻게든 집을 벗어나려고 한다.', value: 'e'}
    ]
  },
  {
    number: '3/12',
    question: '갑자기 사람 많은 식당에서 연인이 "자 이거 한입해, 휘이잉~" 비행기를 시전한다.',
    choices: [
      {text: '사람 많은 곳에서 이걸 어떻게 해', value: 'i'},
      {text: '눈을 크게 뜬채 입을 크게 연다.', value: 'e'}
    ]
  },
  {
    number: '4/12',
    question: '연인이 친한 이성친구를 만나러 간다고 했을 때 나는?',
    choices: [
      {text: '신경이 자꾸 쓰이지만 약속이니까 일단 보내준다.', value: 's'},
      {text: '약속이여도 이것 저것 따져가며 못가게 막는다.', value: 'n'}
    ]
  },
  {
    number: '5/12',
    question: '나는 어두운 골목을 걷고 있다. 드는 생각은?',
    choices: [
      {text: '갑자기 뒤에서 누군가 달려올 것만 같다.', value: 'n'},
      {text: '여기 왜 이렇게 어둡지 무섭게', value: 's'}
    ]
  },
  {
    number: '6/12',
    question: '비가 많이 내려서 우산을 쓰고 집으로 가는 길이다. 갑자기 10분 마다 천둥 번개가 내리친다. 나는?',
    choices: [
      {text: '번개 칠 때 우산 쓰면 벼락 맞을 가능성이 높다고 했는데, 번개 맞으면 감전되나? 오만가지 생각이 들면서 소름이 돋는다.', value: 'n'},
      {text: '천둥소리 너무 무서워.. 빨리 가야겠다..', value: 's'}
    ]
  },
  {
    number: '7/12',
    question: '소개팅에서 상대가 "킹받네", "어쩔티비" 말투를 썼을 때 나의 반응은?',
    choices: [
      {text: '나도 슬쩍 "어쩔 세탁기"라고 하면서 맞춰준다.', value: 'f'},
      {text: '당황스러움을 감추지 못한다.', value: 't'}
    ]
  },
  {
    number: '8/12',
    question: '연인이 고속버스에서 옆자리 이성이 내 어깨에 기대서 자고 있다고 알려줄 때 나는?',
    choices: [
      {text: '당장 깨우라고 화를 낸다.', value: 't'},
      {text: '신경은 쓰이지만 차분하게 깨우라고 말한다.', value: 'f'}
    ]
  },
  {
    number: '9/12',
    question: '연인이 있는데 다른 이성에게 대쉬를 받았을 때 나는?',
    choices: [
      {text: '"나 오늘 대쉬 받았다~?" 라는 말을 장난스럽게 말한다.', value: 't'},
      {text: '연인 기분을 생각해서 속으로만 좋아하고 말하지 않는다.', value: 'f'}
    ]
  },
  {
    number: '10/12',
    question: '좋아하는 이성한테 고백하기로 마음을 먹었다. 나는?',
    choices: [
      {text: '언제 어떻게 고백할지 머릿속으로 계획을 세우고 만반의 준비를 한다.', value: 'j'},
      {text: '분위기가 이끄는대로 고백한다.', value: 'p'}
    ]
  },
  {
    number: '11/12',
    question: '연인이 말도 없이 갑자기 내 집에 찾아왔다. 나는?',
    choices: [
      {text: '말도 없이 찾아오면 조금 불편하고 당황스러움', value: 'j'},
      {text: '놀라긴 했지만 크게 상관없이 반겨준다.', value: 'p'}
    ]
  },
  {
    number: '12/12',
    question: '친구하고 강원도 여행 계획을 세웠는데 혹여나 차질이 생기면 계획해 둔 것들을 다 못하게된다. 여행 당일 친구가 지각해서 강원도 가는 버스를 놓쳐버렸다.',
    choices: [
      {text: '화는 나지만 뭐 별 수 있나 그냥 다른거 하자', value: 'jp'},
      {text: '계획에 차질이 생겨 스트레스가 조금씩 달아 오름', value: 'j'}
    ]
  }
]

export const results = [
  {
    title: '닭발',
    character: '../images/result.png',
    results: [
      '술을 워낙 좋아해서 술자리가 있으면 무조건 달려가요.<br>술게임을 하면서 마시든 진지한 얘기를 하면서 마시든 술자리만 마음에 들면 뭐든 좋아요. 술잔만 잘쳐주면 분위기는 내가 책임진다~!<br>술자리에서 친구들이 고민을 얘기하면 잘 경청해주는데 감정적인 공감은 장담 못해요.<br>공감보다는 현실적인 조언을 해주기 때문에 남들은 상쳐받을 수 있어요. 그래서 조언을 해줄땐 각별히 조심해줘야되요.<br>그리고 성격이 빠릿빠릿한 편이라 느릿느릿한 사람들 보면 조금 답답하게 느껴질 수 있어요.<br>그래서 되도록이면 안주나 술집 고를때 그리고 계산할땐 주로 내가 다 해요.<br>회식자리에서 직장 상사들이 좋아하는 스타일이에요.<br>BUT! 친구들 사이에서는 젊은 꼰x가 될 수도 있어요.<br>mbti를 좋아하고 어느정도 신뢰하고 있어서 술자리에서 가끔씩 mbti얘기 꺼내면서 대화 나누면 좋아해요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '꼬치',
    character: '../images/result.png',
    results: [
      '술도 좋아하고 술자리도 좋아해요. 그냥 "술"이라는 단어가 들어가면 세상 행복<br>주당(술을 매우 잘 마시며 즐기는 사람) 그 자체에요.<br>술만 마시면 흥이 주체가 안되요.<br>술부심도 당연히 있어서 잔 치자고 계속 외치다가 어느샌가부터 눈이 풀려있어요.<br>술 취하면 했던말 자꾸 반복하는데 본인은 모를수도 있어요.<br>술만 마시면 양옆에 팔짱끼고 2,3차까지 가자고 노래를 불러요.<br>걱정이나 고민들어주고 심오한 얘기 나누는 술자리 보단 장난치고 내기하면서 하하 호호 웃고 떠드는 분위기가 좋아요.<br>'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '치킨',
    character: '../images/result.png',
    results: [
      '술메이트와 만나면 인싸중에 인싸 평소보다 말도 많아지고 흥을 주체할 수 없어요.<br>집가고 싶었는데 친구들이 2,3차 가자고 하면 설득당해서 어쩔 수 없이 따라가요.<br>술먹고 노래방은 꼭 가야되고 노래방에서 진짜 잘 놀 자신있어요.<br>술먹고 잠깐 바람쐬러 나가서 아이스크림도 꼭 먹어줘야되요.<br>그래서 술먹다가 없어지면 아이스크림 먹으러간거에요 ㅋㅋ<br>술자리에서 텐션 떨어지면 다시 텐션 올려주는 서포터에요.<br>친구들이 말하거나 신나서 텐션을 올리면 장단에 맞추고 호응도 잘 해줘요.<br>그래서 술자리가 진짜 오래갈 수 밖에 없어요.<br>그리고 술자리에선 내 얘기는 잘 안하는데 남 얘기는 진짜 잘 들어줘요<br>내가 얘기나 고민 꺼내는거면 상대방이 내 얘기 잘 들어주고 진짜 편한 친구들이여서 그런거에요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '해물탕',
    character: '../images/result.png',
    results: [
      '술만 먹으면 너무 신나서 텐션도 올라가고 흥이 주체가 안되요.<br>그리고 술마시고 바람쐬러 밖에 나오면 나도 모르게 달리고 싶어져요.<br>술 취하면 그냥 계주선수가 되요.<br>그리고 친구들이 무슨말만 하면 나도 모르게 웃음이 터지고 창가로 보이는 밖에 사람들도 너무 웃겨요.<br>술자리에서 친구들이 고민을 털어놓으면 해결책보다는 잘 들어주고 공감을 해주는데<br>분위기가 우울해지거나 싸해지는걸 못버텨서 갑자기 텐션을 올리고 짠을 외치면서 다시 분위기를 재미있게 바꿀려고 해요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '닭볶음탕',
    character: '../images/result.png',
    results: [
      '술먹기전 안주 고를때 답답하게 못정하고 있으면 먼저 나서서 이걸로 시키자고 해요.<br>그리고 술만 먹으면 갑자기 뜬금없는 소리를 자주 뱉어요.<br>그래서 대화의 맥락이 어디로 이어질지 몰라요.<br>근데 또 재밌고 분위기는 잘 띄워서 술자리 분위기 메이커에요.<br>술을 먹으면 가끔씩 평소에 혼자 속으로 생각했던 사업 아이디어나 그런것들을 남발해요.<br>그리고 분위기가 무르익은 술자리에선 오래 못버티고 속으로 "집에가고 싶어"만 10번은 외쳐요.<br>술은 천천히 음미 하면서 마시고 대화를 많이 하는걸 좋아해요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '막창 & 곱창',
    character: '../images/result.png',
    results: [
      '술자리에서는 새로운 사람들과 금방 친해지는 핵인싸 기질이 있어요.<br>그리고 워낙 말이 많다보니까 자칫하면 tmi가 될 수 있어요.<br>말을 조금 아끼고 발언건을 다른친구들한테 넘겨주면 술자리가 더 재밌질거에요.<br>워낙 자유분방하고 친화력이 좋아서 동아리 모임같이 어색한 술자리에서도 주저하지 않고 처음보는 사람들과도 친분을 잘 쌓고 잘 놀아요.<br>술만 마시면 이친구 저친구 다 불러서 소개 시켜줄려고 해요.<br>가끔씩 분위기가 다운된다 싶으면 술게임이나 다른 주제로 술자리를 잘 리드해요.<br>그리고 뒤끝이 없고 속에 담아두지 않고 술을 마실때 바로바로 말하면서 해결합니다.<br>그리고 경쟁심이 강하고 자존심이 있는편이라 절대 술배틀을 하자고 도발하면 큰일나요.<br>솔직히 말해서 지금도 술 한잔 하고 싶어서 미치겠어요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '나가사끼짬뽕',
    character: '../images/result.png',
    results: [
      '술보단 술자리가 좋아하고 대화를 많이 하는걸 좋아해요.<br>평소에도 그렇고 술자리에서 친구들 고민 상담도 잘 해주고 은근 친구들 얘기나 고민 듣는것도 좋아해요.<br>술은 기분 좋을때까지 마시는걸 가장 좋아하기 때문에 그래서 보통 무리가 가지 않는 선까지만 마실려고 해요.<br>그리고 술 먹기전에는 다음날 속이 뒤집어 질 수도 있고 과음할 수도 있으니까 미리 미리 숙취해소제를 챙겨 먹어요.<br>술자리가 재밌고 기분 좋으면 취할때까지 마셔도 상관없어요~<br>평소에 책임감이 강하고 배려하는 습관이 몸에 배겨있어서 본인도 취했는데 다른 애들을 챙기고 있어요.<br>그리고 술취한 친구들의 술주정 역시 전부 받아주고 술자리가 끝나고 집에 도착하면 다른친구들도 집에 잘 들어갔는지 꼭 여부까지 체크하는 편이에요.<br>그리고 1차도 안끝났는데 벌써부터 2,3차는 어디로 가면 좋을지 미리 정해두고 있어요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '해물파전enfp',
    character: '../images/result.png',
    results: [
      '술자리에서 엄청 재밌게 노는것은 물론이고 분위기도 잘 띄워요.<br>하지만 얼마 못가서 금방 지치게 되요.<br>남들이 고민을 털어놓으면 자기 고민인 것 마냥 몰입해서 들어주고 잘 받아주기 때문에 주변에 술 먹자고 하는 사람이 많아요.<br>술을 마시면 친구에게 고민이나 서운했던거 고마웠던것들을 다 털어놓아서 우정이 더 끈끈해져요.<br>BUT! 너무 취하면 친구에 대한 애정 폭팔해서 시도때도 없이 계속 달라붙고 스킨십이 늘어나요.<br>그리고 감정 기복이 심해서 술만 먹으면 나도 모르게 친구들한테 고마워서 울음이 터치고 다음날 정신 차리고 후회를 많이 하는 편이에요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '회',
    character: '../images/result.png',
    results: [
      '단체 술자리나 안친한 애들이 있는 술자리는 너무 불편해서 잘 안가요.<br>그냥 친한친구들 몇명만 모여서 먹는 술자리가 좋아요.<br>그리고 술게임에 관심도 없고 너무 활발한 분위기에서 술을 마실때는 너무 기빨려서 힘들어요.<br>그냥 재밌는 썰 듣고 얘기하면서 마시는 술자리를 선호해요.<br>술을 별로 안좋아하고 취할때까진 안마시기 때문에 본인 술버릇이 뭔지 몰라요.<br>술자리에서 남이 얘기하면 잘 경청하고 잘 받아주는데 본인 얘기는 잘 안꺼내요.<br>그리고 술자리를 오래 가지는 것 보단 술을 빠르게 마시고 집으로 귀가하는 편이에요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '껍데기',
    character: '../images/result.png',
    results: [
      '평소에는 말 수도 적고 감정 표현이 서툴러서 차가운 이미지지만 술에 취하면 텐션도 올라가고 안길려고 해요.<br>확실히 술먹기 전과 후가 다른걸 알 수가 있어요.<br>술만 먹으면 평소 안하던 오글거리는 말들을 많이해요.<br>나름 술부심도 가지고 있어서 친한애들이 술배틀 하자고 하면 흔쾌히 수락해요.<br>술에 취해도 표정부터 행동에 변화가 없어서 상대방은 취한건가 햇갈려해요.<br>마실땐 잘 마시는데 평소에는 술을 별로 좋아하지는 않고 어색한 분위기를 싫어해서 진짜 편한 친구들끼리 마시는 술자리만 골라서 가요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '마른안주',
    character: '../images/result.png',
    results: [
      '시끄러운 분위기의 술집 보다는 포장마차나 룸형식으로 된 술집도 좋은데 편하게 집에서 마시는걸 가장 좋아해요.<br>술게임도 잘 못하고 술게임을 좋아하지않는데 막상하면 열심히 해요.<br>그냥 친한친구들끼리 마시는거면 술게임을 하든 뭘하든 상관없어요.<br>그리고 평소에도 그렇고 술자리에서는 내 얘기를 하는 경우가 드물어요.<br>진짜 믿음이 가는 친구에게만 고민을 꺼내놓아요.<br>그리고 항상 술자리가 끝나면 취한친구들을 먼저 택시에 태워서 보내고 택시 뒷번호까지 캡쳐해두고 그제야 나도 집가는 편이에요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '만두전골',
    character: '../images/result.png',
    results: [
      '술을 그닥 좋아하지 않고 평소에 내 얘기를 잘 하지 않는데<br>술만 먹으면 안하던 말들도 하고 신나게 놀아요.<br>하지만 텐션을 오래 유지하지 못하고 금방 지쳐서 침묵 상태가 되버려요.<br>그래서 잠깐 바람쐬러 밖을 나갔다 오거나 2차로 노래방 가주면 좋아요.<br>여럿이서 마시는거 보단 친한친구랑 둘이 마시는게 좋아요.<br>술에 취하면 맨정신으로 못했던 얘기들을 마구 내뱉고 다음날 후회하는편이에요.'
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '삽겹살',
    character: '결과 이미지 경로.png',
    results: [
      '술 먹기전엔 오랜만에 친구들도 보고 술자리가 기대되서 엄청 들떠있는편이에요.<br>신나게 노는 분위기보다는 친구들 고민 들어주거나 진지한 대화 나누는 잔잔한 분위기의 술자리가 좋아요.<br>술집을 어디로 갈지 정할때 안주나 가격은 괜찮은지 다 따져가면서 결정하고 인솔해요.<br>술을 그닥 좋아하지 않아서 되도록이면 1,2차만 빠르게 마시고 집으로 가는 편이에요.<br>술자리에서 친구들이 고민을 말하면 공감보다는 현실적으로 답해주는편이에요.<br>술집가서 왕창 마시는 것 보다는 그냥 고깃집이나 주류파는 일반 식당에서 간단하게 마시는 술이 최고에요.',
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '닭갈비',
    character: '../images/result.png',
    results: [
      '술을 안좋아해서 누가 먹자고 하지 않는 한 술을 잘 안마셔요.<br>술을 마시게 되도 맥주나 하이볼 한 두잔 마시는거면 괜찮아요.<br>보통 혼술하거나 친한 친구 몇명정도만 모여서 가볍게 대화하면서 마시는걸 좋아해요.<br>당연히 술게임하거나 여럿이서 마시는 술자리는 별로 안좋아하고 그런곳에 가면 기빨려서 힘들어요.<br>취할때까지 절대 안마시기 때문에 손에 꼽을 정도로 술주정을 해본적이 없어요.<br>다 모르겠고 안주만 맛있으면 됨~',
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '김치찌게를 좋아해',
    character: '../images/result.png',
    results: [
      '술보다는 술자리를 좋아하는편이여서 재미없는 술자리에서는 잘 안들어가는편이에요. 혼술은 더더욱 안해요.<br>재밌는 분위기나 술이 잘 들어갈때는 왕창 마시기 때문에 술자리 분위기에 따라 극과 극이에요.<br>친한 친구랑 단 둘이 일상 대화나 심오한 주제로 대화 나누면서 마시는걸 선호해요.<br>가끔은 여럿이서 술게임도 하면서 노는 분위기도 좋아해요.<br>그리고 술만 먹으면 나도 모르게 깊은 생각에 잠기고 잠깐 말 안 건 사이에 혼자 멍 때리게 되요<br>평소에 친구들한테 하도 궁금한게 많아서 술만 먹으면 질문을 많이하는 편이에요.<br>그리고 은근히 술자리에서 집중받는걸 좋아하고 집중받으면 말도 많아지고 재밌어져요.',
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  },
  {
    title: '튀김',
    character: '../images/result.png',
    results: [
      '술을 워낙 좋아해서 술 먹자고 하면 미치도록 환장해요.<br>1차도 아쉽고 2,3차도 살짝 아쉽고 그냥 취할때까지 마셔야지 아쉬움이 풀려요.<br>그리고 술부심 있어서 술배틀을 뜨자고 하면 절대 안빼고 끝까지 안취한 척 술을 들이마셔요.<br>그러고서 다음날 일어나면 어젯밤 있었던 일이 기억이 안나요.<br>술만 마시면 세상 신나서 현란한 끼와 폭풍 애교로 술자리를 휩쓸고 다녀요.<br>친한친구들끼리 마실때는 말도 많아지고 재밌는데<br>불편한 술자리나 여럿이서 노는 동아리 모임 같은 술자리에선 평소보다도 더 조용해지고 경직되요.',
    ],
    compatibility: ['../images/result.png', '../images/result.png'],
  }
]

export const mbtis = {
  estj:0,
  estp:1,
  esfj:2,
  esfp:3,

  entj:4,
  entp:5,
  enfj:6,
  enfp:7,

  istj:8,
  istp:9,
  isfj:10,
  isfp:11,

  intj:12,
  intp:13,
  infj:14,
  infp:15,
}